Repository: airtaxi/CodexAccountSwitch.WinUI
Catalog: CliAccountSwitcher.WinUI/Strings/*/Resources.resw
Source language: en_us
Languages: ja_jp, ko_kr, zh_hans, zh_hant

# AboutPage_AppLicenseSettingsCard.Description
source: This app is distributed under the MIT License.
ja_jp: このアプリは MIT License の下で配布されています。
ko_kr: 이 앱은 MIT License로 배포됩니다.
zh_hans: 此应用基于 MIT License 分发。
zh_hant: 此應用程式依 MIT License 散佈。

# AboutPage_AppLicenseSettingsCard.Header
source: App license
ja_jp: アプリのライセンス
ko_kr: 앱 라이선스
zh_hans: 应用许可证
zh_hant: 應用程式授權

# AboutPage_ClaudeSwapRepositoryButtonTextBlock.Text
source: Open repository
ja_jp: リポジトリを開く
ko_kr: 저장소 열기
zh_hans: 打开仓库
zh_hant: 開啟儲存庫

# AboutPage_ClaudeSwapSettingsCard.Description
source: Inspired by realiti4/claude-swap. Thank you for sharing the original idea.
ja_jp: realiti4/claude-swap から着想を得ました。元のアイデアを共有していただきありがとうございます。
ko_kr: realiti4/claude-swap에서 영감을 받았습니다. 좋은 아이디어를 공유해 주셔서 감사합니다.
zh_hans: 灵感来自 realiti4/claude-swap。感谢分享原始想法。
zh_hant: 靈感來自 realiti4/claude-swap。感謝分享原始想法。

# AboutPage_ClaudeSwapSettingsCard.Header
source: Special thanks
ja_jp: 謝辞
ko_kr: 감사 인사
zh_hans: 特别鸣谢
zh_hant: 特別感謝

# AboutPage_CopyrightHeaderTextBlock.Text
source: Copyright
ja_jp: 著作権
ko_kr: 저작권
zh_hans: 版权
zh_hant: 著作權

# AboutPage_CreatorGitHubButtonTextBlock.Text
source: Open GitHub profile
ja_jp: GitHub プロフィールを開く
ko_kr: GitHub 프로필 열기
zh_hans: 打开 GitHub 个人资料
zh_hant: 開啟 GitHub 個人资料

# AboutPage_CreatorSettingsCard.Description
source: Author
ja_jp: 作者
ko_kr: 제작자
zh_hans: 作者
zh_hant: 作者

# AboutPage_CreatorSettingsCard.Header
source: Howon Lee (airtaxi)
ko_kr: 이호원 (airtaxi)

# AboutPage_DescriptionTextBlock.Text
source: CLI account switcher for AI services. Supports Codex and Claude Code.
ja_jp: CLI Account Switcher は AI サービス向けの CLI アカウント切替アプリです。Codex と Claude Code をサポートしています。
ko_kr: CLI Account Switcher는 AI 서비스용 CLI 계정 전환 도구입니다. Codex와 Claude Code를 지원합니다.
zh_hans: CLI Account Switcher 是面向 AI 服务的 CLI 账号切换器。支持 Codex 和 Claude Code。
zh_hant: CLI Account Switcher 是面向 AI 服務的 CLI 帳號切換器。支援 Codex 和 Claude Code。

# AboutPage_GitHubRepositoryButtonTextBlock.Text
source: Open repository
ja_jp: リポジトリを開く
ko_kr: 저장소 열기
zh_hans: 打开仓库
zh_hant: 開啟儲存庫

# AboutPage_GitHubRepositorySettingsCard.Description
source: View the source code and issues.
ja_jp: ソースコードとイシューを表示します。
ko_kr: 소스 코드와 이슈를 확인합니다.
zh_hans: 查看源代码和问题。
zh_hant: 查看原始碼和議題。

# AboutPage_GitHubRepositorySettingsCard.Header
source: GitHub repository
ja_jp: GitHub リポジトリ
ko_kr: GitHub 저장소
zh_hans: GitHub 仓库
zh_hant: GitHub 儲存庫

# AboutPage_InspirationRepositoryButtonTextBlock.Text
source: Open repository
ja_jp: 元のリポジトリを開く
ko_kr: 저장소 열기
zh_hans: 打开原始仓库
zh_hant: 開啟原始儲存庫

# AboutPage_InspirationSettingsCard.Description
source: Inspired by isxlan0/Codex_AccountSwitch. Thank you for sharing the original idea.
ja_jp: isxlan0/Codex_AccountSwitch から着想を得ました。元のアイデアを共有していただきありがとうございます。
ko_kr: isxlan0/Codex_AccountSwitch에서 영감을 받았습니다. 좋은 아이디어를 공유해 주셔서 감사합니다.
zh_hans: 灵感来自 isxlan0/Codex_AccountSwitch。感谢分享原始想法。
zh_hant: 靈感来自 isxlan0/Codex_AccountSwitch。感谢分享原始想法。

# AboutPage_InspirationSettingsCard.Header
source: Special thanks
ja_jp: 謝辞
ko_kr: 감사 인사
zh_hans: 特别鸣谢
zh_hant: 特別感謝

# AboutPage_LicenseSettingsGroup.Description
source: Review the app license and NuGet package license information.
ja_jp: アプリのライセンスと NuGet パッケージのライセンス情報を確認します。
ko_kr: 앱과 NuGet 패키지 라이선스 정보를 확인합니다.
zh_hans: 查看应用许可证和 NuGet 包许可证信息。
zh_hant: 查看應用程式授權和 NuGet 套件授權資訊。

# AboutPage_LicenseSettingsGroup.Header
source: Licenses
ja_jp: ライセンス
ko_kr: 라이선스
zh_hans: 许可证
zh_hant: 授權

# AboutPage_ProjectSettingsGroup.Description
source: GitHub repository, author, and the original project that inspired this app.
ja_jp: GitHub リポジトリ、作者、このアプリの着想元となった元プロジェクトです。
ko_kr: GitHub 저장소, 제작자, 영감을 준 원본 프로젝트입니다.
zh_hans: GitHub 仓库、作者以及启发此应用的原始项目。
zh_hant: GitHub 儲存庫、作者以及啟發此應用程式的原始項目。

# AboutPage_ProjectSettingsGroup.Header
source: Project
ja_jp: プロジェクト
ko_kr: 프로젝트
zh_hans: 项目
zh_hant: 項目

# AboutPage_ThirdPartyLicensesButtonTextBlock.Text
source: View NuGet packages
ja_jp: NuGet パッケージを表示
ko_kr: NuGet 패키지 보기
zh_hans: 查看 NuGet 包
zh_hant: 查看 NuGet 套件

# AboutPage_ThirdPartyLicensesSettingsCard.Description
source: View the NuGet packages directly referenced by the app.
ja_jp: アプリが直接参照している NuGet パッケージを表示します。
ko_kr: 앱에서 직접 참조하는 NuGet 패키지를 확인합니다.
zh_hans: 查看应用直接引用的 NuGet 包。
zh_hant: 查看應用程式直接引用的 NuGet 套件。

# AboutPage_ThirdPartyLicensesSettingsCard.Header
source: Third-party licenses
ja_jp: サードパーティライセンス
ko_kr: 써드파티 라이선스
zh_hans: 第三方许可证
zh_hant: 第三方授權

# AboutPage_VersionHeaderTextBlock.Text
source: Version
ja_jp: バージョン
ko_kr: 버전
zh_hans: 版本
zh_hant: 版本

# AccountsPageViewModel_DescriptionFormat
source: Store {0} accounts and manage usage and active status.
ja_jp: {0} アカウントを保存し、使用量とアクティブ状態を管理します。
ko_kr: {0} 계정을 저장하고 사용량과 활성 상태를 관리합니다.
zh_hans: 保存 {0} 账号，并管理用量和活跃状态。
zh_hant: 儲存 {0} 帳號，並管理用量和使用中狀態。

# AccountsPageViewModel_NoSelectedAccounts
source: No selection
ja_jp: 選択なし
ko_kr: 선택 없음
zh_hans: 未选择
zh_hant: 未選取

# AccountsPageViewModel_SelectedAccountCountFormat
source: {0} selected
ja_jp: {0} 件選択中
ko_kr: {0}개 선택됨
zh_hans: 已选择 {0} 项
zh_hant: 已選取 {0} 項

# AccountsPage_AccountHeaderTextBlock.Text
source: Account
ja_jp: アカウント
ko_kr: 계정
zh_hans: 账号
zh_hant: 帳號

# AccountsPage_AccountSearchAutoSuggestBox.PlaceholderText
source: Search account name, email, or plan
ja_jp: アカウント名、メール、プランを検索
ko_kr: 계정 이름, 이메일, 플랜 검색
zh_hans: 搜索账号名称、邮箱或方案
zh_hant: 搜尋帳號名稱、電子郵件或方案

# AccountsPage_ActionsHeaderTextBlock.Text
source: Actions
ja_jp: 操作
ko_kr: 작업
zh_hans: 操作
zh_hant: 操作

# AccountsPage_AddAccountTextBlock.Text
source: Add Account
ja_jp: アカウントを追加
ko_kr: 계정 추가
zh_hans: 添加账号
zh_hant: 新增帳號

# AccountsPage_AllPlanFilterSelectorBarItem.Text
source: All
ja_jp: すべて
ko_kr: 전체
zh_hans: 全部
zh_hant: 全部

# AccountsPage_ClaudeCodeAllPlanFilterSelectorBarItem.Text
source: All
ja_jp: すべて
ko_kr: 전체
zh_hans: 全部
zh_hant: 全部

# AccountsPage_ClaudeCodeBackupFileTypeChoice
source: Claude Code Backup
ja_jp: Claude Code バックアップ
ko_kr: Claude Code 백업
zh_hans: Claude Code 备份
zh_hant: Claude Code 備份

# AccountsPage_DeleteAccountDialogMessage
source: Delete this account?
ja_jp: このアカウントを削除しますか?
ko_kr: 이 계정을 삭제할까요?
zh_hans: 要删除此账号吗？
zh_hant: 要刪除此帳號吗？

# AccountsPage_DeleteAccountDialogTitle
source: Delete Account
ja_jp: アカウントを削除
ko_kr: 계정 삭제
zh_hans: 删除账号
zh_hant: 刪除帳號

# AccountsPage_DeleteAccountToolTip.Content
source: Delete
ja_jp: 削除
ko_kr: 삭제
zh_hans: 删除
zh_hant: 刪除

# AccountsPage_DeleteButtonText
source: Delete
ja_jp: 削除
ko_kr: 삭제
zh_hans: 删除
zh_hant: 刪除

# AccountsPage_DeleteExpiredAccountsDeletedMessageFormat
source: Deleted {0} accounts.
ja_jp: {0} 件のアカウントを削除しました。
ko_kr: {0}개 계정을 삭제했습니다.
zh_hans: 已删除 {0} 个账号。
zh_hant: 已刪除 {0} 個帳號。

# AccountsPage_DeleteExpiredAccountsDialogMessage
source: Delete token-expired accounts from the account list?
ja_jp: トークン期限切れのアカウントを一覧から削除しますか?
ko_kr: 토큰이 만료된 계정을 계정 목록에서 삭제할까요?
zh_hans: 要从账号列表中删除令牌已过期的账号吗？
zh_hant: 要從帳號清單中刪除權杖已過期的帳號吗？

# AccountsPage_DeleteExpiredAccountsDialogTitle
source: Clean Expired Accounts
ja_jp: 期限切れアカウントを整理
ko_kr: 만료 계정 정리
zh_hans: 清理过期账号
zh_hant: 清理過期帳號

# AccountsPage_DeleteExpiredAccountsNoAccountsMessage
source: There are no expired accounts to delete.
ja_jp: 削除する期限切れアカウントはありません。
ko_kr: 삭제할 만료 계정이 없습니다.
zh_hans: 没有可删除的过期账号。
zh_hant: 没有可刪除的過期帳號。

# AccountsPage_DeleteExpiredAccountsTextBlock.Text
source: Clean Expired Accounts
ja_jp: 期限切れアカウントを整理
ko_kr: 만료 계정 정리
zh_hans: 清理过期账号
zh_hant: 清理過期帳號

# AccountsPage_DeleteSelectedAccountsDialogMessage
source: Delete {0} accounts?
ja_jp: {0} 件のアカウントを削除しますか?
ko_kr: {0}개 계정을 삭제할까요?
zh_hans: 要删除 {0} 个账号吗？
zh_hant: 要刪除 {0} 個帳號吗？

# AccountsPage_DeleteSelectedAccountsDialogTitle
source: Delete Selected Accounts
ja_jp: 選択したアカウントを削除
ko_kr: 선택 계정 삭제
zh_hans: 删除所选账号
zh_hant: 刪除所選帳號

# AccountsPage_DeleteSelectedAccountsTextBlock.Text
source: Delete Selected
ja_jp: 選択項目を削除
ko_kr: 선택 삭제
zh_hans: 删除所选
zh_hant: 刪除所選

# AccountsPage_ExportBackupDialogMessage
source: Account backup saved.
ja_jp: アカウントのバックアップを保存しました。
ko_kr: 계정 백업을 저장했습니다.
zh_hans: 账号备份已保存。
zh_hant: 帳號備份已儲存。

# AccountsPage_ExportBackupDialogTitle
source: Export Backup
ja_jp: バックアップをエクスポート
ko_kr: 백업 내보내기
zh_hans: 导出备份
zh_hant: 匯出備份

# AccountsPage_ExportBackupTextBlock.Text
source: Export Backup
ja_jp: バックアップをエクスポート
ko_kr: 백업 내보내기
zh_hans: 导出备份
zh_hant: 匯出備份

# AccountsPage_ImportBackupDialogTitle
source: Import Backup
ja_jp: バックアップをインポート
ko_kr: 백업 불러오기
zh_hans: 导入备份
zh_hant: 匯入備份

# AccountsPage_ImportBackupDuplicateCountFormat
source: {0} duplicates
ja_jp: {0} 件重複
ko_kr: {0}개 중복
zh_hans: {0} 个重复
zh_hant: {0} 個重复

# AccountsPage_ImportBackupEmptyResultMessage
source: No accounts to import.
ja_jp: インポートするアカウントがありません。
ko_kr: 불러올 계정이 없습니다.
zh_hans: 没有可导入的账号。
zh_hant: 没有可匯入的帳號。

# AccountsPage_ImportBackupFailureCountFormat
source: {0} failed
ja_jp: {0} 件失敗
ko_kr: {0}개 실패
zh_hans: {0} 个失败
zh_hant: {0} 個失敗

# AccountsPage_ImportBackupLoadingMessage
source: Validating accounts from the backup file.
ja_jp: バックアップファイルのアカウントを検証しています。
ko_kr: 백업 파일의 계정을 검증하는 중입니다.
zh_hans: 正在验证备份文件中的账号。
zh_hant: 正在驗證備份檔案中的帳號。

# AccountsPage_ImportBackupSuccessCountFormat
source: {0} succeeded
ja_jp: {0} 件成功
ko_kr: {0}개 성공
zh_hans: {0} 个成功
zh_hant: {0} 個成功

# AccountsPage_ImportBackupTextBlock.Text
source: Import Backup
ja_jp: バックアップをインポート
ko_kr: 백업 불러오기
zh_hans: 导入备份
zh_hant: 匯入備份

# AccountsPage_NoAccountsDescriptionTextBlock_ClaudeCode.Text
source: Use Add Account to sign in to Claude Code or load credentials.
ja_jp: アカウント追加ボタンから Claude Code にログインするか、認証情報を読み込んでください。
ko_kr: 계정 추가 버튼을 눌러 Claude Code에 로그인하거나 인증 정보를 불러오세요.
zh_hans: 点击“添加账号”登录 Claude Code 或加载认证信息。
zh_hant: 點擊「新增帳號」登入 Claude Code 或載入認證資訊。

# AccountsPage_NoAccountsDescriptionTextBlock_Codex.Text
source: Use Add Account to sign in to Codex or load an auth file.
ja_jp: アカウント追加ボタンから Codex にログインするか、認証ファイルを読み込んでください。
ko_kr: 계정 추가 버튼을 눌러 Codex에 로그인하거나 인증 파일을 불러오세요.
zh_hans: 点击“添加账号”登录 Codex 或加载认证文件。
zh_hant: 點擊「新增帳號」登入 Codex 或載入認證檔案。

# AccountsPage_NoAccountsDescriptionTextBlock_Ollama.Text
source: Use Add Account to sign in to Ollama.
ja_jp: アカウント追加で Ollama にログインします。
ko_kr: 계정 추가 버튼을 눌러 Ollama에 로그인하세요.
zh_hans: 使用添加帐户登录 Ollama。
zh_hant: 使用新增帳戶登入 Ollama。

# AccountsPage_NoAccountsDescriptionTextBlock_OpenCodeGo.Text
source: Use Add Account to sign in to OpenCode Go.
ja_jp: アカウント追加ボタンから OpenCode Go にログインしてアカウントを追加してください。
ko_kr: 계정 추가 버튼을 눌러 OpenCode Go에 로그인하여 계정을 추가하세요.
zh_hans: 点击“添加账号”登录 OpenCode Go 以添加账号。
zh_hant: 點擊「新增帳號」登入 OpenCode Go 以新增帳號。

# AccountsPage_NoAccountsDescriptionTextBlock_Zai.Text
source: Use Add Account to import the current Z.ai account or enter an API key.
ja_jp: アカウント追加ボタンから現在の Z.ai アカウントを取り込むか、API キーを入力してください。
ko_kr: 계정 추가 버튼을 눌러 현재 Z.ai 계정을 불러오거나 API 키를 입력하세요.
zh_hans: 点击“添加账号”导入当前 Z.ai 账号或输入 API 密钥。
zh_hant: 點擊「新增帳號」匯入目前 Z.ai 帳號或輸入 API 金鑰。

# AccountsPage_NoAccountsTitleTextBlock.Text
source: No accounts registered.
ja_jp: 登録済みアカウントがありません。
ko_kr: 등록된 계정이 없습니다.
zh_hans: 尚未注册账号。
zh_hant: 尚未註冊帳號。

# AccountsPage_NoFilteredAccountsDescriptionTextBlock.Text
source: Adjust the search text or plan filter.
ja_jp: 検索テキストまたはプランフィルターを調整してください。
ko_kr: 검색어나 플랜 필터를 조정하세요.
zh_hans: 请调整搜索文本或方案筛选。
zh_hant: 請調整搜尋文字或方案篩選。

# AccountsPage_NoFilteredAccountsTitleTextBlock.Text
source: No accounts match the filter.
ja_jp: 条件に一致するアカウントがありません。
ko_kr: 조건에 맞는 계정이 없습니다.
zh_hans: 没有符合筛选条件的账号。
zh_hant: 没有符合篩選條件的帳號。

# AccountsPage_OllamaBackupFileTypeChoice
source: Ollama Backup (.ollamab)
ja_jp: Ollama バックアップ (.ollamab)
ko_kr: Ollama 백업 (.ollamab)
zh_hans: Ollama 备份 (.ollamab)
zh_hant: Ollama 備份 (.ollamab)

# AccountsPage_OpenCodeGoBackupFileTypeChoice.Text
source: OpenCode Go backup (.ocb)
ja_jp: OpenCode Go バックアップ (.ocb)
ko_kr: OpenCode Go 백업 (.ocb)
zh_hans: OpenCode Go 备份 (.ocb)
zh_hant: OpenCode Go 備份 (.ocb)

# AccountsPage_PlanHeaderTextBlock.Text
source: Plan
ja_jp: プラン
ko_kr: 플랜
zh_hans: 方案
zh_hant: 方案

# AccountsPage_RefreshAccountLoadingMessage
source: Refreshing account usage.
ja_jp: アカウントの使用量を更新しています。
ko_kr: 계정 사용량을 새로고침하는 중입니다.
zh_hans: 正在刷新账号用量。
zh_hant: 正在重新整理帳號用量。

# AccountsPage_RefreshAccountToolTip.Content
source: Refresh
ja_jp: 更新
ko_kr: 새로고침
zh_hans: 刷新
zh_hant: 重新整理

# AccountsPage_RefreshAllAccountsLoadingMessage
source: Refreshing usage for all accounts.
ja_jp: すべてのアカウントの使用量を更新しています。
ko_kr: 전체 계정 사용량을 새로고침하는 중입니다.
zh_hans: 正在刷新所有账号的用量。
zh_hant: 正在重新整理所有帳號的用量。

# AccountsPage_RefreshAllAccountsTextBlock.Text
source: Refresh
ja_jp: 更新
ko_kr: 새로고침
zh_hans: 刷新
zh_hant: 重新整理

# AccountsPage_RefreshSelectedAccountsLoadingMessage
source: Refreshing usage for selected accounts.
ja_jp: 選択したアカウントの使用量を更新しています。
ko_kr: 선택한 계정 사용량을 새로고침하는 중입니다.
zh_hans: 正在刷新所选账号的用量。
zh_hant: 正在重新整理所選帳號的用量。

# AccountsPage_RefreshSelectedAccountsTextBlock.Text
source: Refresh Selected
ja_jp: 選択項目を更新
ko_kr: 선택 새로고침
zh_hans: 刷新所选
zh_hant: 重新整理所選

# AccountsPage_RenameAccountDialogTitle
source: Rename Account
ja_jp: アカウント名を変更
ko_kr: 계정 이름 변경
zh_hans: 重命名账号
zh_hant: 重新命名帳號

# AccountsPage_RenameAccountPlaceholderText
source: Leave blank to reset to email
ja_jp: 空欄にするとメールに戻します
ko_kr: 공란 시 이메일로 재설정
zh_hans: 留空将重置为邮箱
zh_hant: 留空将重設為電子郵件

# AccountsPage_RenameAccountToolTip.Content
source: Rename
ja_jp: 名前変更
ko_kr: 이름 변경
zh_hans: 重命名
zh_hant: 重新命名

# AccountsPage_RestartClaudeCodeSessionButtonText
source: Restart
ja_jp: 再起動
ko_kr: 재시작
zh_hans: 重启
zh_hant: 重新啟動

# AccountsPage_RestartClaudeCodeSessionDialogMessage
source: Account switching is complete. Restart running VS Code windows to use the changed account immediately. Restart now?
ja_jp: アカウントの切り替えが完了しました。変更後のアカウントをすぐに使うには、実行中の VS Code を再起動する必要があります。今すぐ再起動しますか?
ko_kr: 계정 전환이 완료되었습니다. 변경된 계정을 바로 사용하려면 실행 중인 VS Code를 재시작해야 합니다. 지금 재시작할까요?
zh_hans: 账号切换已完成。若要立即使用切换后的账号，需要重启正在运行的 VS Code。现在重启吗？
zh_hant: 帳戶切換已完成。若要立即使用切換後的帳戶，需要重新啟動執行中的 VS Code。現在重新啟動嗎？

# AccountsPage_RestartClaudeCodeSessionDialogTitle
source: Restart VS Code
ja_jp: VS Code を再起動
ko_kr: VS Code 재시작
zh_hans: 重启 VS Code
zh_hant: 重新啟動 VS Code

# AccountsPage_RestartClaudeCodeSessionFailedDialogMessage
source: VS Code could not be restarted automatically. Close and reopen VS Code manually.
ja_jp: VS Code を自動的に再起動できませんでした。VS Code を手動で閉じてから再度開いてください。
ko_kr: VS Code를 자동으로 재시작하지 못했습니다. VS Code를 직접 닫았다가 다시 열어 주세요.
zh_hans: 无法自动重启 VS Code。请手动关闭并重新打开 VS Code。
zh_hant: 無法自動重新啟動 VS Code。請手動關閉並重新開啟 VS Code。

# AccountsPage_RestartClaudeCodeSessionFailedDialogTitle
source: Restart failed
ja_jp: 再起動に失敗しました
ko_kr: 재시작 실패
zh_hans: 重启失败
zh_hant: 重新啟動失敗

# AccountsPage_RestartClaudeCodeSessionLoadingMessage
source: Restarting VS Code.
ja_jp: VS Code を再起動しています。
ko_kr: VS Code를 재시작하는 중입니다.
zh_hans: 正在重启 VS Code。
zh_hant: 正在重新啟動 VS Code。

# AccountsPage_RestartCodexApplicationButtonText
source: Restart
ja_jp: 再起動
ko_kr: 재시작
zh_hans: 重启
zh_hant: 重新啟動

# AccountsPage_RestartCodexApplicationDialogMessage
source: The account has been switched. Restart running Codex and VS Code windows to use the changed account immediately. Restart now?
ja_jp: アカウントを切り替えました。変更後のアカウントをすぐに使用するには、実行中の Codex と VS Code を再起動してください。今すぐ再起動しますか?
ko_kr: 계정 전환이 완료되었습니다. 변경된 계정을 바로 사용하려면 실행 중인 Codex와 VS Code를 재시작해야 합니다. 지금 재시작할까요?
zh_hans: 账号已切换。若要立即使用切换后的账号，请重启正在运行的 Codex 和 VS Code。现在重启吗？
zh_hant: 帳號已切換。若要立即使用切換後的帳號，請重新啟動執行中的 Codex 和 VS Code。現在重新啟動吗？

# AccountsPage_RestartCodexApplicationDialogTitle
source: Restart Codex and VS Code
ja_jp: Codex と VS Code を再起動
ko_kr: Codex 및 VS Code 재시작
zh_hans: 重启 Codex 和 VS Code
zh_hant: 重新啟動 Codex 和 VS Code

# AccountsPage_RestartCodexApplicationFailedDialogMessage
source: Codex or VS Code could not be restarted automatically. Close and reopen Codex and VS Code manually.
ja_jp: Codex または VS Code を自動的に再起動できませんでした。Codex と VS Code を手動で閉じて、もう一度開いてください。
ko_kr: Codex 또는 VS Code를 자동으로 재시작하지 못했습니다. Codex와 VS Code를 직접 닫았다가 다시 열어 주세요.
zh_hans: 无法自动重启 Codex 或 VS Code。请手动关闭并重新打开 Codex 和 VS Code。
zh_hant: 無法自動重新啟動 Codex 或 VS Code。請手動關閉並重新開啟 Codex 和 VS Code。

# AccountsPage_RestartCodexApplicationFailedDialogTitle
source: Restart failed
ja_jp: 再起動に失敗しました
ko_kr: 재시작 실패
zh_hans: 重启失败
zh_hant: 重新啟動失敗

# AccountsPage_RestartCodexApplicationLoadingMessage
source: Restarting Codex and VS Code.
ja_jp: Codex と VS Code を再起動しています。
ko_kr: Codex와 VS Code를 재시작하는 중입니다.
zh_hans: 正在重启 Codex 和 VS Code。
zh_hant: 正在重新啟動 Codex 和 VS Code。

# AccountsPage_RestartOpenCodeGoApplicationButtonText
source: Restart
ja_jp: 再起動
ko_kr: 재시작
zh_hans: 重启
zh_hant: 重新啟動

# AccountsPage_RestartOpenCodeGoApplicationDialogMessage
source: Account switching is complete. Restart the running OpenCode Go desktop app to apply the change?
ja_jp: アカウント切り替えが完了しました。実行中の OpenCode Go デスクトップアプリを再起動して変更を適用しますか？
ko_kr: 계정 전환이 완료되었습니다. 실행 중인 OpenCode Go 데스크톱 앱을 재시작하여 변경사항을 적용하시겠습니까?
zh_hans: 账户切换已完成。是否重启正在运行的 OpenCode Go 桌面应用以应用更改？
zh_hant: 帳號切換已完成。是否重新啟動執行中的 OpenCode Go 桌面應用程式以套用變更？

# AccountsPage_RestartOpenCodeGoApplicationDialogTitle
source: Restart OpenCode Go
ja_jp: OpenCode Go を再起動
ko_kr: OpenCode Go 재시작
zh_hans: 重启 OpenCode Go
zh_hant: 重新啟動 OpenCode Go

# AccountsPage_RestartOpenCodeGoApplicationFailedDialogMessage
source: Failed to restart the OpenCode Go desktop app. Please restart it manually.
ja_jp: OpenCode Go デスクトップアプリの再起動に失敗しました。手動で再起動してください。
ko_kr: OpenCode Go 데스크톱 앱 재시작에 실패했습니다. 수동으로 재시작해 주세요.
zh_hans: 无法重启 OpenCode Go 桌面应用。请手动重启。
zh_hant: 無法重新啟動 OpenCode Go 桌面應用程式。請手動重新啟動。

# AccountsPage_RestartOpenCodeGoApplicationFailedDialogTitle
source: Restart failed
ja_jp: 再起動に失敗しました
ko_kr: 재시작 실패
zh_hans: 重启失败
zh_hant: 重新啟動失敗

# AccountsPage_RestartOpenCodeGoApplicationLoadingMessage
source: Restarting OpenCode Go...
ja_jp: OpenCode Go を再起動中...
ko_kr: OpenCode Go 재시작 중...
zh_hans: 正在重启 OpenCode Go...
zh_hant: 正在重新啟動 OpenCode Go...

# AccountsPage_StatusHeaderTextBlock.Text
source: Status
ja_jp: 状態
ko_kr: 상태
zh_hans: 状态
zh_hant: 狀態

# AccountsPage_SwitchAccountToolTip.Content
source: Switch
ja_jp: 切り替え
ko_kr: 전환
zh_hans: 切换
zh_hant: 切換

# AccountsPage_TitleTextBlock.Text
source: Account Management
ja_jp: アカウント管理
ko_kr: 계정 관리
zh_hans: 账号管理
zh_hant: 帳號管理

# AccountsPage_UsageHeaderTextBlock.Text
source: Usage
ja_jp: 使用量
ko_kr: 사용량
zh_hans: 用量
zh_hant: 用量

# AccountsPage_ZaiBackupFileTypeChoice
source: Z.ai Backup
ja_jp: Z.ai バックアップ
ko_kr: Z.ai 백업
zh_hans: Z.ai 备份
zh_hant: Z.ai 備份

# AccountsPage_ZipBackupFileTypeChoice
source: ZIP Backup
ja_jp: ZIP バックアップ
ko_kr: ZIP 백업
zh_hans: ZIP 备份
zh_hant: ZIP 備份

# AddAccountDialog.CloseButtonText
source: Cancel
ja_jp: キャンセル
ko_kr: 취소
zh_hans: 取消
zh_hant: 取消

# AddAccountDialog.Title
source: Add Account
ja_jp: アカウントを追加
ko_kr: 계정 추가
zh_hans: 添加账号
zh_hant: 新增帳號

# AddAccountDialog_CurrentAccountSelectorBarItem.Text
source: Signed-in Account
ja_jp: サインイン済みアカウント
ko_kr: 로그인된 계정
zh_hans: 已登录账号
zh_hant: 已登入帳號

# AddAccountDialog_FileSelectorBarItem.Text
source: Load File
ja_jp: ファイルを読み込む
ko_kr: 파일 불러오기
zh_hans: 加载文件
zh_hant: 載入檔案

# AddAccountDialog_ManualPasteSelectorBarItem.Text
source: Manual Paste
ja_jp: 手動貼り付け
ko_kr: 수동 붙여넣기
zh_hans: 手动粘贴
zh_hant: 手動貼上

# AddAccountDialog_OAuthSelectorBarItem.Text
source: OAuth
ko_kr: OAuth 인증

# AddOllamaAccountDialog.CloseButtonText
source: Close
ja_jp: 閉じる
ko_kr: 닫기
zh_hans: 关闭
zh_hant: 關閉

# AddOllamaAccountDialog.Title
source: Add Ollama Account
ja_jp: Ollama アカウント追加
ko_kr: Ollama 계정 추가
zh_hans: 添加 Ollama 帐户
zh_hant: 新增 Ollama 帳戶

# AddOpenCodeGoAccountDialog.CloseButtonText
source: Close
ja_jp: 閉じる
ko_kr: 닫기
zh_hans: 关闭
zh_hant: 關閉

# AddOpenCodeGoAccountDialog.Title
source: Add OpenCode Go Account
ja_jp: OpenCode Go アカウントを追加
ko_kr: OpenCode Go 계정 추가
zh_hans: 添加 OpenCode Go 账户
zh_hant: 新增 OpenCode Go 帳號

# AddOpenCodeGoAccountDialog_ApiKeySelectorBarItem.Text
source: API Key
ja_jp: API キー
ko_kr: API 키
zh_hans: API 密钥
zh_hant: API 金鑰

# AddOpenCodeGoAccountDialog_CurrentAccountSelectorBarItem.Text
source: Current Account
ja_jp: 現在のアカウント
ko_kr: 현재 계정
zh_hans: 当前账户
zh_hant: 目前帳戶

# AddZaiAccountDialog.CloseButtonText
source: Close
ja_jp: 閉じる
ko_kr: 닫기
zh_hans: 关闭
zh_hant: 關閉

# AddZaiAccountDialog.Title
source: Add Z.ai Account
ja_jp: Z.ai アカウントを追加
ko_kr: Z.ai 계정 추가
zh_hans: 添加 Z.ai 账户
zh_hant: 新增 Z.ai 帳戶

# AddZaiAccountDialog_ApiKeySelectorBarItem.Text
source: API Key
ja_jp: API キー
ko_kr: API 키
zh_hans: API 密钥
zh_hant: API 金鑰

# AddZaiAccountDialog_CurrentAccountSelectorBarItem.Text
source: Current Account
ja_jp: 現在のアカウント
ko_kr: 현재 계정
zh_hans: 当前账户
zh_hant: 目前帳戶

# AppDescription
source: CLI account switcher for AI services. Supports Codex and Claude Code.
ja_jp: CLI Account Switcher は AI サービス向けの CLI アカウント切替アプリです。Codex と Claude Code をサポートしています。
ko_kr: CLI Account Switcher는 AI 서비스용 CLI 계정 전환 도구입니다. Codex와 Claude Code를 지원합니다.
zh_hans: CLI Account Switcher 是面向 AI 服务的 CLI 账号切换器。支持 Codex 和 Claude Code。
zh_hant: CLI Account Switcher 是面向 AI 服務的 CLI 帳號切換器。支援 Codex 和 Claude Code。

# CurrentAccountAddAccountPage_ClaudeCodeDescription
source: Read the current Claude Code credential and global config files, then save them as a managed account.
ja_jp: 現在の Claude Code credential と global config ファイルを読み取り、管理対象アカウントとして保存します。
ko_kr: 현재 Claude Code credential과 global config 파일을 읽어 관리 계정으로 저장합니다.
zh_hans: 读取当前 Claude Code credential 和 global config 文件，并保存为托管账号。
zh_hant: 讀取目前 Claude Code credential 和 global config 檔案，並儲存為受管理帳戶。

# CurrentAccountAddAccountPage_ClaudeCodeErrorMessage
source: Current Claude Code credentials could not be saved. Sign in with Claude Code first.
ja_jp: 現在の Claude Code credential を保存できませんでした。先に Claude Code にログインしてください。
ko_kr: 현재 Claude Code credential을 저장하지 못했습니다. 먼저 Claude Code에 로그인하세요.
zh_hans: 无法保存当前 Claude Code credential。请先登录 Claude Code。
zh_hant: 無法儲存目前 Claude Code credential。請先登入 Claude Code。

# CurrentAccountAddAccountPage_ClaudeCodeFilePathHeader
source: Claude Code files
ja_jp: Claude Code ファイル
ko_kr: Claude Code 파일
zh_hans: Claude Code 文件
zh_hant: Claude Code 檔案

# CurrentAccountAddAccountPage_ClaudeCodeImportButtonText
source: Save current Claude Code account
ja_jp: 現在の Claude Code アカウントを保存
ko_kr: 현재 Claude Code 계정 저장
zh_hans: 保存当前 Claude Code 账号
zh_hant: 儲存目前 Claude Code 帳戶

# CurrentAccountAddAccountPage_ClaudeCodeTitle
source: Save current Claude Code account
ja_jp: 現在の Claude Code アカウントを保存
ko_kr: 현재 Claude Code 계정 저장
zh_hans: 保存当前 Claude Code 账号
zh_hant: 儲存目前 Claude Code 帳戶

# CurrentAccountAddAccountPage_DescriptionTextBlock.Text
source: Read the currently signed-in Codex .codex/auth.json and validate the account with a usage request.
ja_jp: 現在サインインしている Codex の .codex/auth.json を読み取り、使用量リクエストでアカウントを検証します。
ko_kr: 현재 Codex에 로그인된 .codex/auth.json을 읽고 Usage 요청으로 계정을 검증합니다.
zh_hans: 读取当前已登录 Codex 的 .codex/auth.json，并通过用量请求验证账号。
zh_hant: 讀取目前已登入 Codex 的 .codex/auth.json，並通過用量請求驗證帳號。

# CurrentAccountAddAccountPage_ErrorInfoBar.Message
source: An error occurred while importing the signed-in account.
ja_jp: サインイン済みアカウントのインポート中にエラーが発生しました。
ko_kr: 로그인된 계정을 불러오는 중 오류가 발생했습니다.
zh_hans: 导入已登录账号时发生错误。
zh_hant: 匯入已登入帳號時發生錯誤。

# CurrentAccountAddAccountPage_ErrorInfoBar.Title
source: Failed to Add Account
ja_jp: アカウントの追加に失敗しました
ko_kr: 계정 추가 실패
zh_hans: 添加账号失败
zh_hant: 新增帳號失敗

# CurrentAccountAddAccountPage_FilePathHeaderTextBlock.Text
source: File to Read
ja_jp: 読み込むファイル
ko_kr: 읽을 파일
zh_hans: 要读取的文件
zh_hant: 要讀取的檔案

# CurrentAccountAddAccountPage_ImportButtonTextBlock.Text
source: Import Signed-in Account
ja_jp: サインイン済みアカウントをインポート
ko_kr: 로그인된 계정 가져오기
zh_hans: 导入已登录账号
zh_hant: 匯入已登入帳號

# CurrentAccountAddAccountPage_TitleTextBlock.Text
source: Import Signed-in Account
ja_jp: サインイン済みアカウントをインポート
ko_kr: 로그인된 계정 불러오기
zh_hans: 导入已登录账号
zh_hant: 匯入已登入帳號

# DashboardPageViewModel_NoLowUsageAccounts
source: None
ja_jp: なし
ko_kr: 없음
zh_hans: 无
zh_hant: 無

# DashboardPageViewModel_TotalAccountDescriptionFormat
source: Based on saved {0} accounts.
ja_jp: 保存済み {0} アカウントに基づきます。
ko_kr: 저장된 {0} 계정 기준입니다.
zh_hans: 基于已保存的 {0} 账号。
zh_hant: 根據已儲存的 {0} 帳號。

# DashboardPage_ActiveAccountSectionDescriptionTextBlock.Text
source: Remaining quota for the current Active account.
ja_jp: 現在のアクティブアカウントの残りクォータです。
ko_kr: 현재 활성 계정의 남은 할당량입니다.
zh_hans: 当前活跃账号的剩余配额。
zh_hant: 目前使用中帳號的剩餘配額。
